export const buildingInfo = {
  '공학 7호관': {
    image: '/build/main/공학7호관.PNG',
    floors: {
      '7': ['7705A', '7705B', '7706', '7707', '7714'],
      '6': ['7605', '7606', '7607', '7615'],
      '5': ['7506', '7507A', '7507B', '7514'],
      '4': ['7405', '7406', '7409', '7418'],
      '3': ['7306', '7307'],
      '2': ['7205', '7206', '7207'],
      '1': ['7102A'],
    },

    lounge: '1층',
    offices: ['2층-IT 공과대학 행정실'],

    roomDetails: {
      '7102A': { type: '강당', image: '/build/class/rounge.PNG' },
      '7205': { type: '컴퓨터 실습실' },
      '7206': { type: '컴퓨터 실습실' },
      '7207': { type: '컴퓨터 실습실' },
      '7306': { type: '컴퓨터 실습실' },
      '7307': { type: '컴퓨터 실습실', image: '/build/class/7307.PNG' },
      '7405': { type: '일반 강의실' },
      '7406': { type: '컴퓨터 실습실' },
      '7409': { type: '컴퓨터 실습실' },
      '7418': { type: '일반 강의실', image: '/build/class/7418.PNG' },
      '7506': { type: '컴퓨터 실습실' },
      '7507A': { type: '컴퓨터 실습실' },
      '7507B': { type: '컴퓨터 실습실' },
      '7514': { type: '일반 강의실' },
      '7605': { type: '컴퓨터 실습실' },
      '7606': { type: '컴퓨터 실습실' },
      '7607': { type: '컴퓨터 실습실' },
      '7615': { type: '일반 강의실', image: '/build/class/7615.PNG'  },
      '7705A': { type: '컴퓨터 실습실' },
      '7705B': { type: '컴퓨터 실습실', image: '/build/class/7507B.PNG' },
      '7706': { type: '일반 강의실', image: '/build/class/7707.PNG'  },
      '7707': { type: '컴퓨터 실습실' },
      '7714': { type: '일반 강의실' },
    }
  },
  // 다른 건물들도 추가 가능
};
